In [2]:
#Pandas
#Pandas Dataframe
import pandas as pd

In [3]:
import numpy as np

In [6]:
np.arange(0,20,1).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [8]:
#Create a dataframe
df = pd.DataFrame(data=np.arange(0,20,1).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['col1','col2','col3','col4'])

In [9]:
df

      col1  col2  col3  col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int32
 1   col2    5 non-null      int32
 2   col3    5 non-null      int32
 3   col4    5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [13]:
df.describe()

            col1       col2       col3       col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [14]:
##iNDEXING
#loc
#xolumnname
#iloc
df.head()

      col1  col2  col3  col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [15]:
df[['col1','col2','col3']] #using coln names

      col1  col2  col3
Row1     0     1     2
Row2     4     5     6
Row3     8     9    10
Row4    12    13    14
Row5    16    17    18

In [18]:
type(df['col1']) #Series has only one col or row

pandas.core.series.Series

In [20]:
type(df.loc['Row1'])

pandas.core.series.Series

In [23]:
df.head()

      col1  col2  col3  col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [25]:
df.iloc[2:4,1:3]

      col2  col3
Row3     9    10
Row4    13    14

In [29]:
df.loc['Row1']

col1    0
col2    1
col3    2
col4    3
Name: Row1, dtype: int32

In [32]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [33]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [35]:
#Create a dataframe
df = pd.DataFrame(data=[[1,np.nan,2],[1,2,3]],index=['Row1','Row2'],columns=['col1','col2','col3'])

In [36]:
df

      col1  col2  col3
Row1     1   NaN     2
Row2     1   2.0     3

In [37]:
df.isnull().sum()

col1    0
col2    1
col3    0
dtype: int64